/*# Масиви та методи рядкочків

1. Напиши цикл, який виведе на консоль числа від 1 до 10.
1. Напиши цикл, який виведе на консоль парні числа від 1 до 20.
1. Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.
1. Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до
   10).
1. Напиши цикл, який обчислить факторіал числа, введеного користувачем
   (наприклад, факторіал числа 5: `!5 = 1 * 2 * 3 * 4 * 5`).

1. Напиши цикл, який виведе кожну другу літеру рядочку "Hello world"
1. Напиши цикл, який виведе кожну літеру рядочку "Hello world" у зворотньому
   порядку.
1. Напиши цикл, який виведе кожну літеру рядочку "Hello world" поки не зустріне
   пробіл.
1. Напиши цикл, який виведе на консоль кожну другу літеру слова "JavaScript".

1. Напиши функцію, яка приймає рядок та повертає перевернутий рядок
1. Напиши функцію, яка приймає рядок та повертає рядок де кожен другий символ у
   верхньому регістрі
1. Напиши функцію getString(str1, str2, count). Функція повинна додати str2 до
   рядочка str1 стільки разів скільки вказали у параметрі count.

   */

// Task 1

/*for (let i = 0; i <= 10; i++) {
  message = i;
  // console.log(message);
}*/

// Task 2

/*for (let i = 0; i <= 20; i++) {
  if (i % 2 === 0) {
    message = i;
    // console.log(message);
  }
}*/

// Task 3 Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.
/*let sum = 0;
for (let i = 0; i <= 100; i++) {
  //sum = sum + i;
  sum += i;
} */

//console.log(sum);

// Task 4 Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до  10).

/*let message4 = "";
for (let i = 0; i <= 10; i++) {
  message4 = `7*${i}=` + 7 * i;
  //console.log(message4);
}
*/
// Task 5  Напиши цикл, який обчислить факторіал числа, введеного користувачем
//(наприклад, факторіал числа 5: `!5 = 1 * 2 * 3 * 4 * 5`).
/*
let number = +prompt(`Введіть якесь число, для обчислення факторіалу`);
let f = 1;
for (let i = 1; i <= number; i += 1) {
  f = f * i;
}

console.log(`${number}! = ${f}`); */

// Task 6 Напиши цикл, який виведе кожну другу літеру рядочку "Hello world"
/*
let str = "Hello world";

for (let i = 0; i < str.length; i += 2) {
  console.log(str[i]);
}
*/
