// ЗМІНІ
/*
Створіть змінну з ім'ям name і присвойте їй ваше ім'я. Виведіть це ім'я в консоль.

Створіть змінну age і присвойте їй ваш вік. Виведіть в консоль рядок, що містить ваш вік у такому форматі: "Мені {вік} років".

Створіть змінні x і y і присвойте їм довільні числа. Виведіть в консоль результати додавання, віднімання, множення та ділення цих чисел.

Створіть змінну city і присвойте їй назву вашого міста. Створіть рядок, який містить "Я живу в місті {назва міста}", і виведіть його в консоль.

Створіть рядок з вашою електронною поштою. Використайте методи рядка, щоб витягнути ваше ім'я та доменну частину. Виведіть обидва ці значення в консоль.

Створіть змінну price і присвойте їй число. Створіть рядок, що містить ціну з символом гривні, наприклад: "Ціна: 500 грн".*/

// Завдання № 1

const firstName = "Andrii";
const age = 42;

console.log(firstName);
console.log(`Мені ${age} років`);

const x = 13;
const y = 5;

console.log(x + y);
console.log(x - y);
console.log(x / y);
console.log(x * y);
console.log(x ** y);
console.log(x % y);

const city = "Kyyv";
const result = "Я живу в місті" + " " + city;

console.log(result);

const email = "0952720919ua@gmail.com.ua";

const parts = email.split("@");

const userName = parts[0];
const domain = parts[1];

console.log(
  `Ім'я користувача - ${userName}, доменне ім'я електронної пошти - ${domain}`
);

const price = 500;
const currency = "грн.";

console.log(`Ціна: ${price} ${currency}`);

//////////////////////////////// Додаткові завдання //////////////////////////////////

/* Створи змінну someString і присвой їй будь-який рядок.
Обчисли довжину цього рядка, використовуючи властивість .length.
Виведи довжину рядка в консоль.*/

const someString = "I have never been to Japan";
const width = someString.length;

console.log(`Довжина рядка "${someString}" становить ${width}`);
